#+TITLE: Pkgs-make Walk-through
#+SETUPFILE: ../../internal/setup.org

* Following along with code

  This tutorial introduces Pkgs-make using a small shell script program as an
  example. To illustrate a little complexity, the program is split into two
  packages, a library and an executable application.

  The library package is just a single-file shell script defining a single
  function ~do_with_header~ that can be sourced in shell with the ~.~ (dot)
  operator. This function prints to the standard output the command to be run,
  and then runs it.

  The application package runs this function to call the same open-source GNU
  Hello program we introduced in the [[../0-nix-intro/README.org][previous tutorial]].

  Everything is tied together in [[./build.nix][this tutorial's =build.nix= file]].  This
  file evaluates to an attribute set with a few derivations.  One of the
  attributes is our final application, called ~example-shell-app~. This
  application provides a shell script called =example-shell=:

  #+BEGIN_SRC shell :results output :exports both
    nix build --no-link --file build.nix example-shell-app
    tree "$(nix path-info --file build.nix example-shell-app)"
  #+END_SRC

  #+RESULTS:
  : /nix/store/l4rwsx6wmzp1218i2bpy21ilddd0qr03-example-shell
  : └── bin
  :     └── example-shell
  :
  : 1 directory, 1 file

  Here's an invocation of it using ~nix run~:

  #+BEGIN_SRC shell :results output :exports both
    nix run --file build.nix example-shell-app --command example-shell
  #+END_SRC

  #+RESULTS:
  :
  :
  : *****
  : ***** /nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/bin/hello
  : *****
  :
  : Hello, world!

*** Example library code

    The [[./library/default.nix][=default.nix= for our library]] is as follows:

    #+INCLUDE: ./library/default.nix src nix

    Notice that this function takes in an attribute set that must have a
    ~writeText~, ~coreutils~, and ~gnused~ attribute.

    The ~call.package~ function available via Pkgs-make is a variant of the
    standard function available at the top-level ~callPackage~ of Nixpkgs,
    which it ultimately delegates to. These functions use reflection to see
    which attributes are required by a function (in our case ~writeText~,
    ~coreutils~, and ~gnused~), and then pass them in. This use of reflection
    is called [[callpackage][“call-package”-style]]. We didn't cover this in our prior Nix
    tutorial. Overuse of reflection can become anti-modular. So while we
    delegate to a few “call” functions that use the call-package style, many
    would advise against using it beyond that.

    When reflecting, ~call.package~ (same as the standard ~callPackage~
    function in Nixpkgs) will recognize attributes at the top-level of Nixpkgs.
    Both ~coreutils~ and ~gnused~ are derivations there:

    #+BEGIN_SRC shell :results silent :exports code
    nix search 'nixpkgs.(coreutils|gnused)$'
    #+END_SRC

    # This is just to remove ANSI coloring
    #+BEGIN_SRC shell :results output :exports results
    nix search 'nixpkgs.(coreutils|gnused)$' | sed "s,\x1B\[[0-9;]*m,,g"
    #+END_SRC

    #+RESULTS:
    : Attribute name: nixpkgs.coreutils
    : Package name: coreutils
    : Version: 8.29
    : Description: The basic file, shell and text manipulation utilities of the GNU operating system
    :
    : Attribute name: nixpkgs.gnused
    : Package name: gnused
    : Version: 4.5
    : Description: GNU sed, a batch stream editor

    The ~writeText~ attribute is not a derivation, but a function not found by
    ~nix search~. There are a lot of functions at Nixpkgs' top-level. Some of
    these are documented in the [[nixpkgs-manual][Nixpkgs manual]]. Others you discover by looking
    at other people's Nix expressions or by reading the Nixpkgs source code.

    ~writeText~ produces a derivation for a single-file package given a name for
    the package, and the text content for the file. We use string interpolation
    to have the =/nix/store= paths of dependencies injected into the script.

    Let's take a look at the built library file in =/nix/store=:

    #+BEGIN_SRC shell :results output :exports both
    cat `nix path-info --file build.nix example-shell-lib`
    #+END_SRC

    #+RESULTS:
    : do_with_header()
    : {
    :     /nix/store/n7qp8pffvcb5ff52l2nrc3g2wvxfrk75-coreutils-8.29/bin/echo
    :     /nix/store/n7qp8pffvcb5ff52l2nrc3g2wvxfrk75-coreutils-8.29/bin/echo
    :     /nix/store/n7qp8pffvcb5ff52l2nrc3g2wvxfrk75-coreutils-8.29/bin/echo "***** $@" | /nix/store/4qq502jmmwqrvr9y42m8kax686ppm6mh-gnused-4.5/bin/sed 's/ /\n***** /g'
    :     /nix/store/n7qp8pffvcb5ff52l2nrc3g2wvxfrk75-coreutils-8.29/bin/echo "*****"
    :     /nix/store/n7qp8pffvcb5ff52l2nrc3g2wvxfrk75-coreutils-8.29/bin/echo
    :     "$@"
    : }

    We can see that our string interpolation has hardcoded references to our
    dependencies. We'll discuss the importance of this more later.

*** Example application code

    Now let's look at the [[./application/default.nix][=default.nix= for our application]].

    #+INCLUDE: ./application/default.nix src nix

    This time, we see three inputs that are passed in via call-package
    reflection: ~hello~, ~writeShellScriptBin~, and ~example-shell-lib~.

    ~hello~ is a top-level derivation from Nixpkgs, so as before, we expect
    ~call.package~ to pass it in. But notice that the ~example-shell-lib~ passed
    in is our library, not a top-level package already in Nixpkgs. Every
    derivation built with an invocation of Pkgs-make can access one another to
    use as a build dependency. This is a convenience of using Pkgs-make over the
    ~callPackage~ function in Nixpkgs. Just don't create a dependency cycle
    otherwise the Nix build will fail.

    ~writeShellScriptBin~ is very similar to the ~writeText~ function used
    in our library code.  The major difference is that it turns the text into
    an executable shell script by turning on executable bits and prefixing the
    the text with a typical shell script header line:

    #+BEGIN_SRC shell :results output :exports both
    cat "$(nix path-info --file build.nix example-shell-app)/bin/example-shell"
    #+END_SRC

    #+RESULTS:
    : #!/nix/store/8zkg9ac4s4alzyf4a8kfrig1j73z66dw-bash-4.4-p23/bin/bash
    : . /nix/store/i39wa8v79k231d49i7cs98k55k7rpjmg-example-shell-lib
    : do_with_header /nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/bin/hello "$@"
    :

    Again, you see that we've used string interpolation to inject =/nix/store=
    paths into our shell script. This is very important for a couple of reasons.

    1. We often want our application to work consistently, irrespective of what
       a user has installed on their system. Shell scripts in particular often
       rely on a variety of applications beyond a standard installation.

    2. In Nix explicit references to =/nix/store= is how Nix recognizes
       dependencies, which has implications for correct caching and garbage
       collection.

    Because of our textual references, Nix recognizes all the following
    dependencies transitively:

    #+BEGIN_SRC shell :results output :exports both
     nix path-info --recursive --file build.nix example-shell-app
    #+END_SRC

    #+RESULTS:
    : /nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10
    : /nix/store/4qq502jmmwqrvr9y42m8kax686ppm6mh-gnused-4.5
    : /nix/store/83lrbvbmxrgv7iz49mgd42yvhi473xp6-glibc-2.27
    : /nix/store/8zkg9ac4s4alzyf4a8kfrig1j73z66dw-bash-4.4-p23
    : /nix/store/93ljbaqhsipwamcn1acrv94jm6rjpcnd-acl-2.2.52
    : /nix/store/i39wa8v79k231d49i7cs98k55k7rpjmg-example-shell-lib
    : /nix/store/l4rwsx6wmzp1218i2bpy21ilddd0qr03-example-shell
    : /nix/store/n7qp8pffvcb5ff52l2nrc3g2wvxfrk75-coreutils-8.29
    : /nix/store/rmq6gnybmxxzpssj3s63sfjivlq4inrm-attr-2.4.47

** Nix-built Docker image

   We can build Docker images with Nix without requiring an installation of
   Docker. Here's the Nix expression from our =build.nix= file:

   #+INCLUDE: ./build.nix src text :lines "16-23"

   Just as Pkgs-make passes us a ~call~ attribute, we are also passed in a
   ~lib~ attribute that has some useful utilities for building Nix expressions.
   ~lib.nix~ is the standard ~lib~ of Nixpkgs, but extended with a few more
   functions by Pkgs-make. The ~lib.nix.dockerTools.buildImage~ attribute is
   the same function as in Nixpkgs. You can learn more about this function and
   others available in the [[nixpkgs-dockertools][~dockerTools~ section of the Nixpkgs manual]].

   Note that our Nix expression specifies a Docker image name of
   “example-shell” and also all the information that would normally be in a
   separate ~Dockerfile~ (like the entry point). This builds an self-contained
   archive file that we can copy to any computer that has Docker installed and
   load with a ~docker load~ invocation:

   #+BEGIN_SRC shell :results output :exports both
    nix build --no-link --file build.nix example-shell-docker
    docker load --input \
        "$(nix path-info --file build.nix example-shell-docker)"
   #+END_SRC

   #+RESULTS:
   : Loaded image: example-shell:latest

   At this point, we can run the loaded Docker image without concern that Nix
   was used to build the image:

   #+BEGIN_SRC shell :results output :exports both
     docker run --rm -i example-shell
   #+END_SRC

   #+RESULTS:
   :
   :
   : *****
   : ***** /nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/bin/hello
   : *****
   :
   : Hello, world!

** Nix-built self-contained tarball

   Pkgs-make provides a function to create a self-contained tarball on the
   ~lib.nix.tarball~ attribute:

   #+INCLUDE: ./build.nix src text :lines "24-26"

   This tarball is self-contained and includes all the =/nix/store= files
   necessary to run the application. As a convenience, some symlinks are also
   included with pointers to top-level folders for our application:

   #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*)
     nix build --no-link --file build.nix example-shell-tarball
     tar --list --verbose \
             --file "$(nix path-info --file build.nix example-shell-tarball)" \
         | awk '{print $6, $7, $8}'
   #+END_SRC

   #+RESULTS:
   #+begin_example
   nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/
   nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/share/
   nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/share/man/
   nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/share/man/man1/
   nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/share/man/man1/hello.1.gz
   …
   nix/store/rmq6gnybmxxzpssj3s63sfjivlq4inrm-attr-2.4.47/lib/libattr.so.1.1.0
   nix/store/rmq6gnybmxxzpssj3s63sfjivlq4inrm-attr-2.4.47/lib/libattr.so -> libattr.so.1
   nix/store/rmq6gnybmxxzpssj3s63sfjivlq4inrm-attr-2.4.47/lib/libattr.so.1 -> libattr.so.1.1.0
   nix/store/rmq6gnybmxxzpssj3s63sfjivlq4inrm-attr-2.4.47/lib/libattr.la
   bin -> /nix/store/l4rwsx6wmzp1218i2bpy21ilddd0qr03-example-shell/bin
   #+end_example

   Because Nix-built artifacts have hardcoded references to =/nix/store=, this
   tarball must be unpacked to a root filesystem. We'll show next how to use it
   to build out the root filesystem of a Docker image, but this tarball may be
   useful with other utilities like the Unix =chroot= command.

   Here's the [[./Dockerfile][Dockerfile]] we'll use to unpack our tarball into an image:

   #+INCLUDE: ./Dockerfile src dockerfile

   Note that it's base layer is the =scratch= Dockerfile image, which is
   completely empty. We're really not using the Dockerfile for anything other
   than unpacking our tarball. In other applications, we may also set up
   environment variables or expose ports, but the files within the image have
   been entirely constructed by Nix.

   We can now build our Docker image the standard Docker way:

   #+BEGIN_SRC shell :results output :exports both
     cp "$(nix path-info --file build.nix example-shell-tarball)" example-shell.tar
     docker build --tag example-shell-tarball .
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Sending build context to Docker daemon  38.91MB
   Step 1/3 : FROM scratch
    --->
   Step 2/3 : ADD example-shell.tar /
    ---> b96570d8e614
   Step 3/3 : ENTRYPOINT ["/bin/example-shell"]
    ---> Running in 2d5c04bbbaf5
   Removing intermediate container 2d5c04bbbaf5
    ---> 1cf298171615
   Successfully built 1cf298171615
   Successfully tagged example-shell-tarball:latest
   #+end_example

   And our Docker image runs as we'd expect:

   #+BEGIN_SRC shell :results output :exports both
     docker run --rm -i example-shell-tarball
   #+END_SRC

   #+RESULTS:
   :
   :
   : *****
   : ***** /nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10/bin/hello
   : *****
   :
   : Hello, world!

** Usage

   Figuring out whether an application is properly licensed requires going
   through all the licenses of all the dependencies used.

   Unfortunately, Nix doesn't offer a complete solution for this, but Pkgs-make
   can help a little.

   The ~example-shell-licenses~ attribute of the Nix expression in [[./build.nix][=build.nix=
   file]] has an expression that generates a JSON file with license information
   for many of the dependencies required:

   #+INCLUDE: ./build.nix src text :lines "27-30"

   We can use a tool like =jq= to nicely render it.

   #+BEGIN_SRC shell :results output :exports both :post crop(text=*this*, first-n=12)
    nix build --no-link --file build.nix example-shell-licenses
    jq . < "$(nix path-info --file build.nix "example-shell-licenses")"
   #+END_SRC

   #+RESULTS:
   #+begin_example
   {
     "example-shell-app": [
       {
         "homepage": "http://www.gnu.org/software/hello/manual/",
         "license": {
           "fullName": "GNU General Public License v3.0 or later",
           "shortName": "gpl3Plus",
           "spdxId": "GPL-3.0+",
           "url": "http://spdx.org/licenses/GPL-3.0+.html"
         },
         "path": "/nix/store/188avy0j39h7iiw3y7fazgh7wk43diz1-hello-2.10"
       },
   …
       {
         "path": "/nix/store/rmq6gnybmxxzpssj3s63sfjivlq4inrm-attr-2.4.47"
       }
     ]
   }
   #+end_example

